---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateReveal
source: html/05d271ee-9f25-7f5d-6c85-6761fd7b3927.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateReveal Property

Could not create Reveal. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateReveal { get; }
```